//===================== A00_00 崩落都市(ディスク) ====================

//------------------------------------------------
// フェードイン( イベントブロック )
//------------------------------------------------
function FadeIn()
{
	//=======================
	// ■オブジェクト(ギミック)
	//=======================

	// リソース読み込み
	local id_bill = ReadGimmick_("o_A00_04");
	local id_transfer = ReadGimmick_("o_com_01");

	// ■センタービル(点灯)
	local bill_light = ArrangePointGimmick_("o_A00_04", id_bill, "g_bill");
	SetMotion_(bill_light, "GIMMICK_1", 0);

	// ■転送装置(静寂の草原行)
	local transfer01 = ArrangePointGimmick_("o_com_01", id_transfer, "g_transfer");

	// ■転送装置(歓楽の霊道行)
	local transfer02 = ArrangePointGimmick_("o_com_01", id_transfer, "g_transfer_02");


	// ※浮島はイベント側で配置しないこと

	EventEnd_();
}

//=========================================================================================================
//                            ▼▼▼ここから下はローカル関数▼▼▼
//=========================================================================================================

//++++++++++++++++++++++++++++++++++++++++++++++++
//    ローカル関数
//------------------------------------------------
// 引数   : なし
// 戻り値 : なし
//++++++++++++++++++++++++++++++++++++++++++++++++
//function u()
//{
//}

