//===================== A03_00センタービル２９階(ディスク) ====================

//------------------------------------------------
// フェードイン( イベントブロック )
//------------------------------------------------
function FadeIn()
{
	//=======================
	// ■オブジェクト(ギミック)
	//=======================
	// エレベータの扉(開閉アニメをさせる場合はe_elevatorをグローバル変数に変更)
	local elevator_id = ReadGimmick_("o_A03_01");
	local w_elevator  = ArrangePointGimmick_("o_A03_01", elevator_id, "g_elevator_01"); // 西エレベータの扉
	local e_elevator  = ArrangePointGimmick_("o_A03_01", elevator_id, "g_elevator_02"); // 東エレベータの扉
	// エレベータのリフト
	local lift_id = ReadGimmick_("o_A01_01");
	local w_lift  = ArrangePointGimmick_("o_A01_01", lift_id, "g_elevator_lift_01"); // 西エレベータのリフト
	local e_lift  = ArrangePointGimmick_("o_A01_01", lift_id, "g_elevator_lift_02"); // 東エレベータのリフト

	EventEnd_();
}

//=========================================================================================================
//                            ▼▼▼ここから下はローカル関数▼▼▼
//=========================================================================================================

//++++++++++++++++++++++++++++++++++++++++++++++++
//    ローカル関数
//------------------------------------------------
// 引数   : なし
// 戻り値 : なし
//++++++++++++++++++++++++++++++++++++++++++++++++
//function u()
//{
//}

