// Mサイズ、Gサイズモンスターのアイコン１マス表示位置

ic <- [
	// M サイズ
	// ----------------------------

	"ic_0014", 2,	//グランスライム
	"ic_0024", 2,	//メタルカイザー
	"ic_0053", 2,	//ドラゴン
	"ic_0059", 2,	//ダースドラゴン
	"ic_0062", 2,	//スライドラゴン
	"ic_0068", 2,	//竜神王
	"ic_0083", 2,	//白竜王
	"ic_0094", 2,	//じげんりゅう
	"ic_0111", 2,	//じんめんじゅ
	"ic_0121", 2,	//大王イカ
	"ic_0189", 2,	//キマイラロード
	"ic_0267", 2,	//大魔王デスタムーア
	"ic_0357", 2,	//グレイナル
	"ic_0358", 2,	//バルボロス
	"ic_0387", 2,	//スノードラゴン
	"ic_0429", 2,	//スーパーキラーマシン
	"ic_0441", 2,	//神竜
	"ic_0519", 2,	//プテラノドン
	"ic_0523", 2,	//おおイグアナ
	"ic_0532", 2,	//ホーンビートル
	"ic_0548", 2,	//さそりアーマー
	"ic_0554", 2,	//ストロングアニマル
	"ic_0651", 2,	//メタルスコーピオン
	"ic_0674", 2,	//デスタランチュラ
	"ic_0675", 2,	//デッドマスカー
	"ic_0701", 2,	//ゴールドマジンガ
	"ic_0711", 2,	//ライオンヘッド
	"ic_0712", 2,	//サンドシャーク
	"ic_0745", 2,	//トロピカルスライム
	"ic_0852", 2,	//ドラクエ１０枠_ちょうろうじゅ

	// G サイズ
	// ----------------------------

	"ic_0031", 2,	//スライムファミリー
	"ic_0033", 2,	//スラ・ブラスター
	"ic_0034", 2,	//スライダークロボ
	"ic_0122", 3,	//オセアーノン
	"ic_0138", 3,	//ぬしさま
	"ic_0220", 2,	//暗黒の魔神
	"ic_0325", 2,	//暗黒皇帝ガナサダイ
	"ic_0349", 2,	//ヒヒュドラード
	"ic_0352", 3,	//ヘルクラウド
	"ic_0366", 3,	//タイラントワーム
	"ic_0368", 2,	//ウィングタイガー
	"ic_0388", 3,	//やまたのおろち
	"ic_0389", 2,	//マスタードラゴン
	"ic_0427", 2,	//エリスグール
	"ic_0445", 2,	//勇車スラリンガル
	"ic_0567", 2,	//メドーサボール
	"ic_0589", 2,	//魔王デスタムーア
	"ic_0591", 2,	//スラリン船
	"ic_0592", 2,	//スライバ船
	"ic_0594", 2,	//メタルスター
	"ic_0616", 3,	//キングヒドラ
	"ic_0624", 2,	//魔戦車ダビド
	"ic_0643", 2,	//あくまの書
	"ic_0649", 3,	//おおみみず
	"ic_0679", 2,	//ゆうれい船
	"ic_0683", 2,	//魔獣メイザー
	"ic_0760", 2,	//プチヒーロー
	"ic_0796", 2,	//しんかいりゅう
	"ic_0835", 2,	//ドラクエ１０枠_ウルベア魔神兵
	"ic_0838", 3,	//ドラクエ１０枠_怪蟲アラグネ
	"ic_0842", 2,	//ドラクエ１０枠_天魔クァバルナ
	"ic_0846", 2,	//ドラクエ１０枠_冥獣王ネルゲル
	"ic_0857", 2,	//（悪魔の書枠ゴールド３）金の魔王の書
	"ic_0885", 3,	//Wi-Fi大会 衝撃のしっぽ団
	"ic_0892", 2,	//完全新規 街ガエル
	"ic_0715", 2,	//グリフィンクス
	"ic_0718", 2,	//サンドウェーブ
	"ic_0707", 2,	//真ボス変身後
	"ic_0897", 2,	//V龍
	

	
	// T サイズ
	// ----------------------------
	
	"ic_0797", 2,	//しん・りゅうおう
	"ic_0799", 2,	//アスラゾーマ
	"ic_0806", 3,	//オリハルゴン
	"ic_0807", 3,	//ギガサーペント（水龍）
	"ic_0808", 2,	//ユキヤマンモス（雪山）
	"ic_0810", 2,	//完全新規テラ真ドーク
	"ic_0811", 2,	//完全新規テラ（カスタムモンスターのお母さん）
	"ic_0888", 2,	//メタルゴッデス
	"ic_0896", 2,	//名もなき闇の王


]
