//=============================================
//
//		demo700[É^ÉCÉgÉãÉfÉÇÅiëêå¥Åj]
//
//=============================================

//-------------------------------------------------------------------------
//
//		ì«Ç›çûÇ›ÅEîzíu
//
//-------------------------------------------------------------------------
function Update()
{
// Å•ïœêîíËã`
	local task_cam;

// Å•ÉäÉ\Å[ÉXì«çû
	/* Ç»Çµ */

// Å•îzíu
	/* Ç»Çµ */

//-------------------------------------------------------------------------
//		ÇÕÇ∂Ç‹ÇËÇÕÇ∂Ç‹ÇË
//-------------------------------------------------------------------------
	SetFade_(FADE_IN, FADE_COLOR_BLACK, 10);	
	while(true)
	{
		//ReadWaitingLod("lodeye000", "lodtgt000");	

		// Å•ÉJÉbÉgÇPÅóÅ`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`Å`
		SetTime_(START_TIME_ZONE_NOON);		
		SetFogDensity_(2.0);
		task_cam = Task_AnimeMoveCamera_("anmeye000", "anmtgt000");

		
		WaitTask(task_cam);

		

		DeleteTask_(task_cam);

	}
	
		SetFade_(FADE_OUT, FADE_COLOR_BLACK, 20);
		WaitFade_();
}
