//=============================================
//
//		demo032[Cランクライセンス獲得]
//
//=============================================

//-------------------------------------------------------------------------
//
//		読み込み・配置
//
//-------------------------------------------------------------------------
function Update()
{
	
// ▼変数定義
	local task_cam, task_player;
	local efc_player;

// ▼リソース読込
	// キャラクター
	local player = GetPlayerId_();					// 主人公
	// エフェクト
	LoadEffect_("ef732_06_get_license");

// ▼配置
	// 主人公
	SetPointPos_(player, "player000");
	
	SetActive_(player, false);

// ▼非常駐モーション読込
	// 主人公
	local pl_look_up_L = ReadMotion_(player, "Player_look_up_L");			// 上向き待機L
	local pl_licence01_L = ReadMotion_(player, "Player_licence01_L");		// ライセンスゲット1

// ▼カメラ設定
	task_cam = Task_AnimeMoveCamera_("anmeye000", "anmtgt000");

//-------------------------------------------------------------------------
//		はじまりはじまり
//-------------------------------------------------------------------------

	StartDemo(FADE_COLOR_BLACK);
	
	// ▼カット１＠～～～～～～～～～～～～～～～～～～～～～～
	
	//===============================================
	// ■テレジア
	// 「おつかれさまでした。
	//-----------------------------------------------
	OpenMsgWnd_();
	SetTalkName_("NAME_TAG_TEREZIA");
	ShowMsg_("DEMO_032_MSG_010");
	KeyInputWait_();
	CloseMsgWnd_();
	
	Wait_(20);
	DeleteTask_(task_cam);
	SetMotion_(player, pl_look_up_L, BLEND_N);		// 上向き待機L
	
	SetActive_(player, true);
	
	// ▼カット２＠～～～～～～～～～～～～～～～～～～～～～～
	task_cam = Task_AnimeMoveCamera_("anmeye001", "anmtgt001");
	
	//-----------------------------------------------
	// ▽
	// 「おめでとうございます。
	//-----------------------------------------------
	OpenMsgWnd_();
	SetTalkName_("NAME_TAG_TEREZIA");
	ShowMsg_("DEMO_032_MSG_020");
	KeyInputWait_();
	
	//-----------------------------------------------
	// ▽
	// 「当施設の規約に　基づき
	//-----------------------------------------------
	ShowMsg_("DEMO_032_MSG_030");
	KeyInputWait_();
	CloseMsgWnd_();
	//===============================================
	
	DeleteTask_(task_cam);
	
	// ▼カット３＠～～～～～～～～～～～～～～～～～～～～～～
	task_cam = Task_AnimeMoveCamera_("anmeye002", "anmtgt002");
	
	SetMotion_(player, pl_licence01_L, BLEND_N);		// ライセンスゲット1
	PlaySE_("SE_DEM_028");
	efc_player = SetSelectBoneEffect_("ef732_06_get_license", player, ATTACH_GLOBAL);
	Wait_(80);
	
	//===============================================
	// ◇システムメッセージ
	// <name_player/>は
	//-----------------------------------------------
	OpenMsgWnd_();
	ShowMsg_("DEMO_032_MSG_040");
	PlayMe_("ME_010");
	WaitMe_();
	KeyInputWait_();
	CloseMsgWnd_();
	//===============================================
	
	SetMotion_(player, pl_look_up_L, BLEND_XL);		// 上向き待機L
	
	//===============================================
	// ■テレジア
	// 「これより　モンスターに乗って　移動ができる
	//-----------------------------------------------
	OpenMsgWnd_();
	SetTalkName_("NAME_TAG_TEREZIA");
	ShowMsg_("DEMO_032_MSG_050");
	KeyInputWait_();
		
	//-----------------------------------------------
	// ▽
	// 「そして今回は　もうひとつの特典
	//-----------------------------------------------
	ShowMsg_("DEMO_032_MSG_060");
	KeyInputWait_();
	
	//-----------------------------------------------
	// ▽
	// 「これからは　戦闘中に　Ｒボタンを押すことで
	//-----------------------------------------------
	ShowMsg_("DEMO_032_MSG_070");
	KeyInputWait_();
	
	//-----------------------------------------------
	// ▽
	// 「今の　あなたならば　きっと
	//-----------------------------------------------
	ShowMsg_("DEMO_032_MSG_080");
	KeyInputWait_();
	CloseMsgWnd_();
	//===============================================
	
	//===============================================
	// ◇システムメッセージ
	// <name_player/>は
	//-----------------------------------------------
	OpenMsgWnd_();
	ShowMsg_("DEMO_032_MSG_090");
	PlayMe_("ME_010");
	WaitMe_();
	KeyInputWait_();
	CloseMsgWnd_();
	//===============================================
	
	//===============================================
	// ■テレジア
	// 「Ｃ級ライセンスの特典は　以上となります。
	//-----------------------------------------------
	OpenMsgWnd_();
	SetTalkName_("NAME_TAG_TEREZIA");
	ShowMsg_("DEMO_032_MSG_100");
	KeyInputWait_();
	
	//-----------------------------------------------
	// ▽
	// 「なお　陸上ライドの　体験式チュートリアルを
	//-----------------------------------------------
	ShowMsg_("DEMO_032_MSG_110");
	KeyInputWait_();
	
	//-----------------------------------------------
	// ▽
	// 「コロシアムを出たあとに
	//-----------------------------------------------
	ShowMsg_("DEMO_032_MSG_120");
	KeyInputWait_();
	CloseMsgWnd_();
	//===============================================
	
	EndDemo(FADE_COLOR_BLACK);
}