//===================== 拠点【光あふれる地】 ====================

//+++++++++++++++++++++++++++++++++++++++++++++++++
// 起動条件：戦闘終了後
//-------------------------------------------------
// 主な用途：戦闘終了後にフラグを操作する時などを行う
//+++++++++++++++++++++++++++++++++++++++++++++++++
function AfterBattle()
{
	EventEnd_();
}

//+++++++++++++++++++++++++++++++++++++++++++++++++
// 起動条件：FadeIn()より前に呼ばれる
//-------------------------------------------------
// 主な用途：デモ後にライド状態の強制解除や
//           例外的なイベントフラグの設定などを行う
//+++++++++++++++++++++++++++++++++++++++++++++++++
function BeforeInitMap()
{
	EventEnd_();
}

//+++++++++++++++++++++++++++++++++++++++++++++++++
// 起動条件：画面切り替えフェードイン中
//-------------------------------------------------
// 主な用途：NPC、地雷等の読み込みと設置などを行う
//+++++++++++++++++++++++++++++++++++++++++++++++++
function FadeIn()
{
	// 進行フラグの状態を取得
	DebugPrint(" ");
	// 光あふれる地到達フラグ
	SetEventFlg_("BFG_ARRIVE_AT_O03", true);

//----------------------------------------------------------------
// ギミック


//----------------------------------------------------------------
// NPC関連を読込み


//----------------------------------------------------------------
	
	//------------------
	//	エフェクトの設置
	//------------------
	// 光エフェクトの読み込み
	LoadEffect_("ef310_15_weather_map_o01");
	local efc_01 = SetCameraEffect_("ef310_15_weather_map_o01", 100);
	
	
//----------------------------------------------------------------
// リアクターポイント


//----------------------------------------------------------------
// イベント地雷を読込み


	EventEnd_();
}

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 起動条件：フィールド操作開始時
//------------------------------------------------------------------------------
// 主な用途：マップ切り替え直後のデモ再生・バトル開始命令
//           ・戦闘終了時のメッセージの表示・Waitを挟みながら操作するなどを行う
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
function EventStartOperate()
{
	// 進行フラグの状態を取得
	DebugPrint(" ");

//---------------------------------------------------------------------------------------
// デモの再生


	EventEnd_();
}

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 起動条件：FadeIn()などのイベントブロックでArrangePointNpc_()を行ったとき
//------------------------------------------------------------------------------
// 主な用途：NPCに話しかけ行動をした時
// 注意点  ：必ず「target」を条件に設定すること
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
function TouchNpc()
{
	// 進行フラグの状態を取得
	DebugPrint(" ");

	// 話しかける対象のNPCを条件に
	local target    = GetTargetId_();
//	switch(target)
//	{
//	case :
//		break;
//	default:
//		DebugPrint("設置していないNPCに話しかけています。");
//		break;
//	}

	EventEnd_();
}

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 起動条件：マップに配置したメッシュに触れた時
//------------------------------------------------------------------------------
// 主な用途：マップに配置したメッシュに触れたときなど
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
function TouchEventMine()
{
	// 進行フラグの状態を取得
	DebugPrint(" ");

	// 調べたり触ったりしたイベント地雷を条件に
	local target    = GetTouchEventMineId_();
//	switch(target)
//	{
//	case :
//		break;
//	case :
//		break;
//	// 設置していない地雷に接触
//	default:
//		DebugPrint("設置していない地雷に触れています。");
//		break;
//	}

	EventEnd_();
}

//+++++++++++++++++++++++++++++++++++++++++++++++++
// 起動条件：リアクターを起動した時
//-------------------------------------------------
// 主な用途：リアクター起動後のフラグ設定や
//           設置物の操作などを行う
//+++++++++++++++++++++++++++++++++++++++++++++++++
function ReactorOn()
{
	EventEnd_();
}

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 起動条件：リアクターポイントなどを調べた時
//----------------------------------------------------------
// 主な用途：スクリプト設置のリアクターポイントを調べた時
// 注意点  ：使用する際は、FadeIn()などのイベントブロックで
//           SetReactorEvent_()の命令を追加する必要がある
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
function ReactorAnalyze()
{
	EventEnd_();
}

//+++++++++++++++++++++++++++++++++++++++++++++++++++
// 起動条件：リアクターを終了した時
//---------------------------------------------------
// 主な用途：リアクター機能をＯＦＦにするタイミングで
//           フラグ設定や設置物の操作などを行う
//+++++++++++++++++++++++++++++++++++++++++++++++++++
function ReactorOff()
{
	EventEnd_();
}

//======================================================
//  自作関数 : 
//------------------------------------------------------
// 第一引数：
// 第二引数：
// 戻り値  ：なし
//======================================================
// 使わないのでコメント化します
//function Comm()
//{
//}

