//===================== O04_00 拠点【配信用玉座】 ====================

//------------------------------------------------
//		戦闘終了後
//------------------------------------------------
function AfterBattle()
{
	EventEnd_();
}

//------------------------------------------------
//		マップに入る前
//------------------------------------------------
function BeforeInitMap()
{
	EventEnd_();
}

//------------------------------------------------
//		フェードイン
//------------------------------------------------
function FadeIn()
{
	//---------------
	// ▼ギミック配置
	//---------------
	
	// 配置なし
	
	
	//----------
	// ▼NPC配置
	//----------
	
	// 配置なし
	
	
	//-----------
	// ▼地雷配置
	//-----------
	
	// ID初期化
	g_mine_epitaph <- C_NONE_ID;
	
	// ■なぞの碑文
	g_mine_epitaph = SetPointCircleEventMine_("mine_epitaph", true);
	
	
	//-------------------------
	// ▼リアクターポイント配置
	//-------------------------
	// ■なぞの碑文
	ArrangeMsgReactorPoint("reactor_point_01", GetFlagID_("BFG_REACTER_POINT_131"),
							SHORT_DIST, "REC_POINT_01_01", "REC_POINT_01_02");
	
	EventEnd_();
}

//------------------------------------------------
//		フィールド操作開始
//------------------------------------------------
function EventStartOperate()
{
	EventEnd_();
}

//------------------------------------------------
//		ＮＰＣ接触時
//------------------------------------------------
function TouchNpc()
{
	EventEnd_();
}

//------------------------------------------------
//		地雷接触時
//------------------------------------------------
function TouchEventMine()
{
	local target = GetTouchEventMineId_();
	
	DebugPrint("ID: " + target + " に接触 [TouchEventMine]");
	
	switch (target) {
	case g_mine_epitaph :
		uMineEpitaph();
		break;
	default :
		DebugPrint("WARNING : MINE_IDが不正です [TouchEventMine]");
		break;
	}
	
	EventEnd_();
}

//------------------------------------------------
//		リアクター起動時
//------------------------------------------------
function ReactorOn()
{
	EventEnd_();
}

//------------------------------------------------
//		リアクターで調べた時
//------------------------------------------------
function ReactorAnalyze()
{
	EventEnd_();
}

//------------------------------------------------
//		リアクター終了時
//------------------------------------------------
function ReactorOff()
{
	EventEnd_();
}


//=========================================================================================================
//									▼▼▼ここから下はローカル関数▼▼▼
//=========================================================================================================


//++++++++++++++++++++++++++++++++++++++++++++++++
//		なぞの碑文を調べた時
//------------------------------------------------
//	引数	: なし
//	戻り値	: なし
//++++++++++++++++++++++++++++++++++++++++++++++++
function uMineEpitaph()
{
	CommTurnAroundAndSetPlayableCamera(150);
	
	OpenMsgWnd_();
	ShowMsg_("SYSTEM_MSG_EPITAPH");		// 玉座への　見えざる道
	KeyInputWait_();
	CloseMsgWnd_();
}
