//===================== V00_00焦熱の火山(ディスク) ====================

//------------------------------------------------
// フェードイン( イベントブロック )
//------------------------------------------------
function FadeIn()
{
	//=======================
	// ■オブジェクト(ギミック)
	//=======================

	// リソース読み込み
	local id_rockdoor = ReadGimmick_("o_V00_03");
	local id_door = ReadGimmick_("o_V00_05");
	local id_transfer = ReadGimmick_("o_com_01");

	// ■岩壁
	local g_gim_rockdoor = ArrangePointGimmick_("o_V00_03", id_rockdoor, "g_rockdoor");

	// ■発射台の扉
	local g_gim_door01 = ArrangePointGimmick_("o_V00_05", id_door, "gmk_door01");
	local g_gim_door02 = ArrangePointGimmick_("o_V00_05", id_door, "gmk_door02");

	// ■大陸移動装置(黒鉄の監獄塔行)
	local transfer01 = ArrangePointGimmick_("o_com_01", id_transfer, "g_transfer01");


	// ※浮島はイベント側で配置しないこと

	EventEnd_();
}

//=========================================================================================================
//                            ▼▼▼ここから下はローカル関数▼▼▼
//=========================================================================================================

//++++++++++++++++++++++++++++++++++++++++++++++++
//    ローカル関数
//------------------------------------------------
// 引数   : なし
// 戻り値 : なし
//++++++++++++++++++++++++++++++++++++++++++++++++
//function u()
//{
//}

