//=============================================
//
//		demo025[Cランク試験_3(敗北)]
//
//=============================================

//-------------------------------------------------------------------------
//
//		読み込み・配置
//
//-------------------------------------------------------------------------
function Update()
{
	
// ▼変数定義
	local task_cam;

// ▼リソース読込
	// キャラクター
	local player = GetPlayerId_();					// 主人公

// ▼配置
	// 主人公
	SetPointPos_(player, "player000");

// ▼非常駐モーション読込
	local player_zusa_L = ReadMotion_(player, "Player_zusa_L");		// ズサーL

// ▼モーション設定
	SetMotion_(player, player_zusa_L, BLEND_N);

// ▼カメラ設定
	task_cam = Task_AnimeMoveCamera_("anmeye000", "anmtgt000");

//-------------------------------------------------------------------------
//		はじまりはじまり
//-------------------------------------------------------------------------

	StartDemo(FADE_COLOR_BLACK);
	
	//===============================================
	// ■テレジア
	// 「負けてしまわれましたね……。
	//-----------------------------------------------
	OpenMsgWnd_();
	SetTalkName_("NAME_TAG_TEREZIA");
	ShowMsg_("DEMO_025_MSG_010");
	KeyInputWait_();
	
	//-----------------------------------------------
	// ▽
	// 「<name_player/>さまが　チカラをたくわえ
	//-----------------------------------------------
	ShowMsg_("DEMO_025_MSG_020");
	KeyInputWait_();
	CloseMsgWnd_();
	//===============================================
	
	EndDemo(FADE_COLOR_BLACK);
}