//=============================================
//
//		demo800[ルキヤ？からの通信]
//
//=============================================

//-------------------------------------------------------------------------
//
//		読み込み・配置
//
//-------------------------------------------------------------------------
function Update()
{
	
// ▼変数定義
	local task_cam, task_player;
	local efc_player;

// ▼リソース読込
	// キャラクター
	local player = GetPlayerId_();					// 主人公

// ▼配置
	// 主人公
	SetPointPos_(player, "player000");

// ▼非常駐モーション読込
	local p_Player_up03_L = ReadMotion_(player, "Player_up03_L"); //飛び起きるL
	local player_Player_one_knee = ReadMotion_(player, "Player_one_knee");

// ▼カメラ設定
	SetPointCameraEye_("cameye000");
	SetPointCameraTarget_("camtgt000");

//-------------------------------------------------------------------------
//		はじまりはじまり
//-------------------------------------------------------------------------
	SetMotion_(player, p_Player_up03_L, BLEND_N);

	StartDemo(FADE_COLOR_BLACK);

	//===============================================
	//*ルキヤ
	// 	「……聞こえるかい？　<name_player/>。
	//-----------------------------------------------
	OpenMsgWnd_();
	ShowMsg_("DEMO_800_MSG_010");
	KeyInputWait_();
	CloseMsgWnd_();
	//===============================================
	
	OpenConnective("connective_rukiya");

	Wait_(30);	
	//===============================================
	//■ルキヤ
	// 	「まさか　あたしのことを
	//-----------------------------------------------
	OpenMsgWnd_();
	SetTalkName_("NAME_TAG_RUKIYA");
	ShowMsg_("DEMO_800_MSG_020");
	KeyInputWait_();
	//===============================================
	
	//===============================================
	//■ルキヤ
	// 	「あたしだよ！　ルキヤさ　ルキヤ！
	//-----------------------------------------------
	ShowMsg_("DEMO_800_MSG_030");
	KeyInputWait_();
	//===============================================
	
	//===============================================
	//■ルキヤ
	// 	「だけど……よくやってくれたね。
	//-----------------------------------------------
	ShowMsg_("DEMO_800_MSG_040");
	KeyInputWait_();
	//===============================================
	
	//===============================================
	//■ルキヤ
	// 	「聞きたいことは　いろいろ　あるだろうけど
	//-----------------------------------------------
	ShowMsg_("DEMO_800_MSG_050");
	KeyInputWait_();
	//===============================================
	
	//===============================================
	//■ルキヤ
	// 	「ウッドパークで　待っているよ。
	//-----------------------------------------------
	ShowMsg_("DEMO_800_MSG_060");
	KeyInputWait_();
	CloseMsgWnd_();
	//===============================================
	Wait_(10);
	
	CloseConnective();
	task_cam = Task_AnimeMoveCamera_("anmeye000", "anmtgt000");
	Wait_(7);
	
	SetMotionSpeed_(player, 0.75);
	SetMotion_(player, player_Player_one_knee, BLEND_L);
	Wait_(20);
	SetMotion_(player, MOT_WAIT, BLEND_L);
	Wait_(16);
	
	EndDemo(FADE_COLOR_BLACK);

}
