//===================== A03_01センタービル30階(ディスク) ====================

//------------------------------------------------
// フェードイン( イベントブロック )
//------------------------------------------------
function FadeIn()
{
	//=======================
	// ■オブジェクト(ギミック)
	//=======================
	// 管制室メインモニター
	local g_main_screen = ReadGimmick_("o_A03_04");
	local main_screen = ArrangePointGimmick_("o_A03_04", g_main_screen, "g_main_screen");
	// エレベータの扉(開閉アニメをさせる場合はe_elevatorをグローバル変数に変更)
	local elevator_id = ReadGimmick_("o_A03_01");
	local e_elevator  = ArrangePointGimmick_("o_A03_01", elevator_id, "g_elevator"); // 東エレベータの扉
	// エレベータのリフト
	local lift_id = ReadGimmick_("o_A01_01");
	local e_lift  = ArrangePointGimmick_("o_A01_01", lift_id, "g_elevator_lift"); // 東エレベータのリフト

	EventEnd_();
}

//=========================================================================================================
//                            ▼▼▼ここから下はローカル関数▼▼▼
//=========================================================================================================

//++++++++++++++++++++++++++++++++++++++++++++++++
//    ローカル関数
//------------------------------------------------
// 引数   : なし
// 戻り値 : なし
//++++++++++++++++++++++++++++++++++++++++++++++++
//function u()
//{
//}

