//=============================================
//
//		demo306[Bランク試験_3(敗北)]
//
//=============================================

//-------------------------------------------------------------------------
//
//		読み込み・配置
//
//-------------------------------------------------------------------------
//-------------------------------------------------------------------------
function Update()
{
// ▼変数定義
	local task_cam, task_player;
	local efc_player;

// ▼リソース読込
	// キャラクター
	local player = GetPlayerId_();					// 主人公

// ▼配置
	// 主人公
	SetPointPos_(player, "player000");

	//〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓
	//■カット１
	//〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓

	 task_cam = Task_AnimeMoveCamera_("anmeye000", "anmtgt000");

	//=====================================
	//プレイヤー設置
	//=====================================

	//IDの取得
	local player = GetPlayerId_();

	//設置
	SetPointPos_(player, "player000");

	//初期の向き
	SetDir_(player, 180);

	//スライドダウンループ
	local slideloop = ReadMotion_(player, "Player_zusa_L");		//◆尻餅モーションが未実装なのでライドから落ちるモーションで代用しています。

	//初期のモーション
	SetMotion_(player, slideloop, BLEND_N);

//-------------------------------------------------------------------------
//		はじまりはじまり
//-------------------------------------------------------------------------

	//=====================================
	//フェードイン
	//=====================================
	Wait_(5);
	StartDemo(FADE_COLOR_BLACK);

	//===============================================
	//■テレジア
	//「負けてしまわれましたね……。
	//　残念ながら　ライセンス試験は失敗です。
	//-----------------------------------------------
	OpenMsgWnd_();
	SetTalkName_("NAME_TAG_TEREZIA");
	ShowMsg_("DEMO_306_MSG_010");
	KeyInputWait_();
	//===============================================

	//===============================================
	//■テレジア
	//「<name_player/>さまが　チカラをたくわえ
	//　再度　挑戦されるのを　お待ちしています。
	//-----------------------------------------------
	ShowMsg_("DEMO_306_MSG_020");
	KeyInputWait_();
	CloseMsgWnd_();
	//===============================================

	//〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓
	//■デモ終了
	//〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓〓

	EndDemo(FADE_COLOR_BLACK);

}
