//=============================================
//
//		demo708[タイトルデモ（ワールドマップ）]
//
//=============================================

//-------------------------------------------------------------------------
//
//		読み込み・配置
//
//-------------------------------------------------------------------------
function Update()
{
// ▼変数定義
	local task_cam;

// ▼リソース読込
	
	local player = GetPlayerId_();				// 主人公

//-------------------------------------------------------------------------
//		はじまりはじまり
//-------------------------------------------------------------------------
	SetFade_(FADE_IN, FADE_COLOR_BLACK, 10);
	
		SetTime_(START_TIME_ZONE_NOON);		

		local task = Task_AnimeMove_(player, "anm_player00");	//マップ表示させるため主人公配置
		
		task_cam = Task_AnimeMoveCamera_("anmeye000", "anmtgt000");
		
	while(true)
	{
		// ▼カット１＠～～～～～～～～～～～～～～～～～～～～～～
		Wait_(1);

	}
	
		SetFade_(FADE_OUT, FADE_COLOR_BLACK, 20);
		WaitFade_();
}
