//===================== S00_00黒鉄の監獄塔(ディスク) ====================

//------------------------------------------------
// フェードイン( イベントブロック )
//------------------------------------------------
function FadeIn()
{
	//=======================
	// ■オブジェクト(ギミック)
	//=======================

	// リソース読み込み
	local id_paipu_close = ReadGimmick_("o_S02_21");
	local id_paipu_open = ReadGimmick_("o_S02_22");
	local id_transfer = ReadGimmick_("o_com_01");

	// ■パイプの蓋（閉）
	local gmk_paipu_close = ArrangePointGimmick_("o_S02_21", id_paipu_close, "gmk_paipu_close");

	// ■パイプの蓋（開）
	local gmk_paipu_open = ArrangePointGimmick_("o_S02_22", id_paipu_open, "gmk_paipu_open");

	// ■転送装置（凍骨の氷原）
	local transfer01 = ArrangePointGimmick_("o_com_01", id_transfer, "gmk_enter_transfer");

	// ■転送装置（焦熱の火山）
	local transfer02 = ArrangePointGimmick_("o_com_01", id_transfer, "gmk_exit_transfer");


	// ※浮島はイベント側で配置しないこと

	EventEnd_();
}

//=========================================================================================================
//                            ▼▼▼ここから下はローカル関数▼▼▼
//=========================================================================================================

//++++++++++++++++++++++++++++++++++++++++++++++++
//    ローカル関数
//------------------------------------------------
// 引数   : なし
// 戻り値 : なし
//++++++++++++++++++++++++++++++++++++++++++++++++
//function u()
//{
//}

