//===================== テスト３ ====================

function FadeIn()
{
	EventEnd_();
}

//-------------------- 初期化 --------------------
//起動条件：マップチェンジしてきた時
//-------------------- 初期化 --------------------
function EventStartOperate()
{
	EventEnd_();

}

//-------------------- NPC --------------------
//起動条件：NPCに向かってAボタンが押された時
//OpenMsgWnd_() -> ShowMsg_() -> KeyInputWait_() の順に呼び出すこと
//-------------------- NPC --------------------
function TouchNpc()
{
	EventEnd_();
}

//-------------------- イベント地雷 --------------------
//起動条件：マップに配置したメッシュに触れたとき
//-------------------- イベント地雷 --------------------
function TouchEventMine(){
	EventEnd_();
}
